index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>HotDrink Overview</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">HotDrink Overview</h1>
<p>
HotDrink is a JavaScript library for User Interface programming.  Instead of
requiring programmers to write explicit event handlers, HotDrink derives user
interface behavior from a declarative specification of data dependencies.
</p>

<p>
These specifications define ways in which some variables may affect other
variables.  Consider, for example, for specifying a cropping region for an
image.
</p>

<p>
<b>Example:</b> <a href="examples/crop.html">Cropping region of an image</a>
</p>

<p>
This form contains several variables &#x2014; e.g., the left and right boundaries,
the width of the region, and the aspect ratio of the region &#x2014; with many
dependencies between these variables.  To use HotDrink to manage these
dependencies requires two steps.
</p>

<p>
First, you must define the variables and the dependencies, as follows.
</p>

<div class="org-src-container">

<pre class="src src-js"><span style="color: #0000FF;">function</span>  <span style="color: #006699;">sum</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">b</span> ) { <span style="color: #0000FF;">return</span> a + b; }
<span style="color: #0000FF;">function</span> <span style="color: #006699;">diff</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">b</span> ) { <span style="color: #0000FF;">return</span> a - b; }
<span style="color: #0000FF;">function</span> <span style="color: #006699;">prod</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">b</span> ) { <span style="color: #0000FF;">return</span> a * b; }
<span style="color: #0000FF;">function</span> <span style="color: #006699;">quot</span>( <span style="color: #BA36A5;">a</span>, <span style="color: #BA36A5;">b</span> ) { <span style="color: #0000FF;">return</span> a / b; }

<span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
    .variables( {left: 0, top: 0, right: <span style="color: #8b1a1a;">undefined</span>, bottom: <span style="color: #8b1a1a;">undefined</span>,
                 width: 200, height: 200, aspect: <span style="color: #8b1a1a;">undefined</span>} )

    .constraint( <span style="color: #008000;">'left, right, width'</span> )
      .method( <span style="color: #008000;">'left, width -&gt; right'</span>, sum  )
      .method( <span style="color: #008000;">'right, width -&gt; left'</span>, diff )
      .method( <span style="color: #008000;">'right, left -&gt; width'</span>, diff )

    .constraint( <span style="color: #008000;">'top, bottom, height'</span> )
      .method( <span style="color: #008000;">'top, height -&gt; bottom'</span>, sum  )
      .method( <span style="color: #008000;">'bottom, height -&gt; top'</span>, diff )
      .method( <span style="color: #008000;">'bottom, top -&gt; height'</span>, diff )

    .constraint( <span style="color: #008000;">'height, width, aspect'</span> )
      .method( <span style="color: #008000;">'height, aspect -&gt; width'</span>, prod )
      .method( <span style="color: #008000;">'width, aspect -&gt; height'</span>, quot )
      .method( <span style="color: #008000;">'width, height -&gt; aspect'</span>, quot )

    .end();
</pre>
</div>

<p>
Second, you must <i>bind</i> the variables to the elements of the web page that
represent those variables.  This can be done by adding an attribute to the tag
to which you want to bind.
</p>

<div class="org-src-container">

<pre class="src src-html">&lt;<span style="color: #006699;">table</span>&gt;
  &lt;<span style="color: #006699;">tr</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;Left:&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( left )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;Right:&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( right )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;Width:&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( width )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">rowspan</span>=<span style="color: #008000;">"2"</span>&gt;Aspect:&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">rowspan</span>=<span style="color: #008000;">"2"</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( aspect )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
  &lt;/<span style="color: #006699;">tr</span>&gt;
  &lt;<span style="color: #006699;">tr</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;Top:&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( top )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;Bottom:&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( bottom )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;Height:&lt;/<span style="color: #006699;">td</span>&gt;
    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.numVar( height )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
  &lt;/<span style="color: #006699;">tr</span>&gt;
&lt;/<span style="color: #006699;">table</span>&gt;
</pre>
</div>

<p>
Using these two specifications, HotDrink is able to ensure that all data
dependencies are automatically upheld.
</p>

<p>
Not only can HotDrink enforce data dependencies, but it can also use them as
the basis for other useful user interface behaviors.  Consider, for example, a
travel expense report form.
</p>

<p>
<b>Example:</b> <a href="examples/expense.html">Travel expense report</a>
</p>

<p>
Not only does HotDrink enforce the dependencies between the variables in this
form, but it also detects when variables are no longer affecting the output of
the form and disables the corresponding widgets.  This behavior does not
require any additional work on the part of the programmer.
</p>

<p>
HotDrink is designed to handle asynchronous dependencies.  This means, for
example, dependencies can be based on Ajax calls or web workers.  Consider an
application for calculating stock prices.
</p>

<p>
<b>Example:</b> <a href="examples/stocks.html">Stock price checker</a>
</p>

<p>
The data dependency between the stock symbol and the stock price is enforced
by means of an Ajax call to a web service.  This dependency can be enforced
regardless of how long it takes the Ajax request to be completed.  In fact,
HotDrink ensures that any sequence of edits will always eventually end in the
same results, regardless of how long it takes to enforce the dependencies.
</p>

<p>
To illustrate this, consider a simple example involving three circles.
</p>

<p>
<b>Example:</b> <a href="examples/drag1.html">Dragging circles</a>
</p>

<p>
We define a simple data dependency between the centers of these circles that
ensures that they will always remain a certain distance apart.  This creates
the illusion that they are pushing each other around the screen.  Watch what
happens when we deliberately slow this dependency down.
</p>

<p>
<b>Example:</b> <a href="examples/drag2.html">Dragging circles slowed down</a>
</p>

<p>
By adding a delay to the calculation, we have made the effect much slower.
However, the end result of any particular movement is always the same as if
the effects were immediate.  This illustrates how HotDrink ensures data
consistency despite any delays that data dependencies introduce.
</p>

<p>
<b>Example:</b> <a href="examples/drag3.html">Dragging circles slowed down with shadows</a>
</p>

<p>
To make it clear what HotDrink is doing, consider a third example with six
points:  three for circles, and three for shadows.  Since the shadows cannot
be edited (i.e. cannot be dragged) they make it clear how HotDrink remembers
all previous positions and uses them in the calculations.
</p>

<p>
To learn more about HotDrink, please see <a href="howto/">How to use HotDrink</a>.
</p>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
